rppicomidi/rp2040-mcp4728-lib/rp2040_mcp4728_cli.cpp
/**
 * MIT License
 *
 * Copyright (c) 2024 rppicomidi
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 *
 */

#include <cstdio>
#include <cstring>
#include <cctype>
#include <cstdlib>
#include "rp2040_mcp4728_cli.h"
#include "pico/stdlib.h"

rppicomidi::RP2040_MCP4728_cli::RP2040_MCP4728_cli(EmbeddedCli* cli_, RP2040_MCP4728* dac_list_, const uint8_t ndacs_, uint8_t first_dacnum) : cli{cli_}, dac_list{dac_list_},
        ndacs{ndacs_}, dac{dac_list_+first_dacnum}, current_dacnum{first_dacnum}, next_dacnum{first_dacnum}
{
    int result = dac->request_bus(allocation_successful, nullptr);
    assert(result == 1);
    bool add_result = embeddedCliAddBinding(cli, {
            "multi-write",
            "Configure the DAC channel(s); use multi_write cmd with no args for usage",
            true,
            this,
            on_multi_write
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "fast-write",
            "Write DAC code and PD value to all 4 channels; use fast_write cmd with no args for usage",
            true,
            this,
            on_fast_write
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "read",
            "Read and print DAC channel information; use read cmd with no args for usage",
            true,
            this,
            on_read
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "status",
            "Print the Ready/Busy status and the powered-on status",
            true,
            this,
            on_status
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "write-eeprom",
            "Configure DAC registers and program EEPROM to match; use write-eeprom with no args for usage",
            true,
            this,
            on_write_eeprom
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "save",
            "Save the current DAC configuration to EEPROM",
            true,
            this,
            on_save
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "set-gains",
            "Configure DAC gain registers for all 4 channels at once; use set-gains with no args for usage",
            true,
            this,
            on_set_gains
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "set-vrefs",
            "Configure DAC Vref registers for all 4 channels at once; use set-vrefs with no args for usage",
            true,
            this,
            on_set_vrefs
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "set-pds",
            "Configure DAC PD registers for all 4 channels at once; use set-pds with no args for usage",
            true,
            this,
            on_set_pds
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "reset",
            "Send General Call Reset to all I2C devices on the bus",
            true,
            this,
            on_reset
    });
    assert(add_result);
    (void)add_result; // in case not in debug mode
    // flush out junk from the keyboard buffer
    add_result = embeddedCliAddBinding(cli, {
            "wakeup",
            "Send General Call Wakeup to all I2C devices on the bus. Sets PD to 0 all channels.",
            true,
            this,
            on_wakeup
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "update",
            "Send General Call Software Update to all I2C devices on the bus. Updates all DAC outputs at the same time",
            true,
            this,
            on_reset
    });
    assert(add_result);
    if (ndacs > 1) {
        add_result = embeddedCliAddBinding(cli, {
                "select-dac",
                "Set the DAC chip to access",
                true,
                this,
                on_select_dac
        });
    }
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "set-ldac",
            "Set the logic level for the LDAC signal",
            true,
            nullptr,
            on_set_ldac
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "read-addr",
            "Use LDAC and general call read address bits command to read the I2C address bits from the DAC",
            true,
            this,
            on_read_i2c_addr
    });
    assert(add_result);
    add_result = embeddedCliAddBinding(cli, {
            "write-addr",
            "Use LDAC and write address bits command to write new the I2C address bits to the DAC",
            true,
            this,
            on_write_i2c_addr
    });
    assert(add_result);
    (void)add_result;
}

void rppicomidi::RP2040_MCP4728_cli::write_complete(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    printf("MCP4728 # %u write complete\r\n", me->current_dacnum);
}

void rppicomidi::RP2040_MCP4728_cli::allocation_successful(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    printf("MCP4728 # %u deferred allocation successful\r\n", me->current_dacnum);
}

