rppicomidi/rp2040-mcp4728-lib/rp2040_mcp4728_cli.cpp
void rppicomidi::RP2040_MCP4728_cli::reset_complete(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    printf("reset complete\r\n", me->current_dacnum);
}

void rppicomidi::RP2040_MCP4728_cli::seq_polling_callback(void* context, bool is_busy, bool is_powered_on)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    if (is_busy) {
        // poll again
        me->dac->poll_status(seq_polling_callback, me);
    }
    else {
        printf("MCP4728 # %u programming complete\r\n", me->current_dacnum);
    }
}

void rppicomidi::RP2040_MCP4728_cli::seq_write_complete(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    me->dac->poll_status(seq_polling_callback, me);
    printf("MCP4728 # %u registers programmed.\r\nPolling DAC EEPROM...", me->current_dacnum);
}

void rppicomidi::RP2040_MCP4728_cli::print_multi_write_usage()
{
    printf("usage:\r\n\tmulti_write channel[A-D] G[0|1] Vref[0|1] PD[0-3] UDAC[0|1] Code[0-4095]...\r\n\r\n");
    printf("Channel can be A, B, C or D\r\n");
    printf("G=0 means gain=1; G=1 means gain=2 if Vref=1 and Vdd>4.096V\r\n");
    printf("Vref=0 means Vref=Vdd; Vref=1 means Vref=2.048V\r\n");
    printf("PD=0 means out on; PD=1 means out off and 1kOhm to gnd;\r\nPD=2 means out off and 100kOhm to gnd; PD=3 means out off and 500kOhm to gnd\r\n");
    printf("UDAC=0 means update output after channel data write; UDAC=1 writes registers but does not update the output\r\n");
    printf("Code is the 12-bit DAC code 0-4095\r\n");
    printf("example: Set up channels B and C for Gain=1, Vref=Vdd, Outputs On, update immediately, output Vdd/2 and Vdd/4\r\n");
    printf("\tmulti_write B 0 0 0 0 2048 C 0 0 0 0 1024\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_multi_write(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);

    // must be 6 arguments per DAC channel and no more than 4 channels
    if (argc < 6 || ((argc % 6) != 0) || (argc/6) > 4) {
        print_multi_write_usage();
    }
    else {
        const uint8_t nchan = argc/6;
        rppicomidi::mcp4728_channel_data chan_dat[nchan];
        for (uint8_t chan = 0; chan < nchan; chan++) {
            // Get channel letter
            const char* ch = embeddedCliGetToken(args, 1 + (chan*6));
            if (strlen(ch) != 1) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].chan = toupper(ch[0]) - 'A';
            if (chan_dat[chan].chan > 3) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].gain = atoi(embeddedCliGetToken(args, 2 + (chan*6)));
            if (chan_dat[chan].gain > 1) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].vref = atoi(embeddedCliGetToken(args, 3 + (chan*6)));
            if (chan_dat[chan].vref > 1) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].pd = atoi(embeddedCliGetToken(args, 4 + (chan*6)));
            if (chan_dat[chan].pd > 3) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].udac = atoi(embeddedCliGetToken(args, 5 + (chan*6)));
            if (chan_dat[chan].udac > 1) {
                print_multi_write_usage();
                return;
            }
            chan_dat[chan].dac_code = atoi(embeddedCliGetToken(args, 6 + (chan*6)));
            if (chan_dat[chan].dac_code > 4095) {
                print_multi_write_usage();
                return;
            }
        }
        if (!me->dac->multi_write(chan_dat, nchan, write_complete, me)) {
            printf("error writing to MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_fast_write_usage()
{
    printf("usage:\r\n\tfast_write PDA[0-3] CodeA[0-4095] PDB[0-3] CodeB[0-4095] PDC[0-3] CodeC[0-4095] PDD[0-3] CodeD[0-4095] stop[0|1]\r\n\r\n");
    printf("Set the PD code and DAC output code for all 4 channels A-D\r\n");
    printf("In the following, substitute channel A, B, C, or D for ?\r\n");
    printf("PD?=0 means out on; PD=1 means out off and 1kOhm to gnd;\r\nPD=2 means out off and 100kOhm to gnd; PD=3 means out off and 500kOhm to gnd\r\n");
    printf("Code? is the 12-bit DAC code 0-4095\r\n");
    printf("stop=0 omits I2C Stop so subsquent fast_write commands save one byte.\r\nUse stop=1 to send commands other than fast_write after this one\r\n");
    printf("example: all outputs powered on, A=1024, B=2048, C=3072, D=4095 then stop:\r\n");
    printf("\tfast_write 0 1024 0 2048 0 3072 0 4095 1\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_fast_write(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    // must be 9 arguments (PD and DAC code for all 4 channels plus stop 0 or 1)
    if (argc != 9) {
        print_fast_write_usage();
    }
    else {
        uint16_t data[4];
        bool stop = false;
        for (uint8_t chan = 0; chan < 4; chan++) {
            uint16_t pd = atoi(embeddedCliGetToken(args, 1+(chan*2)));
            if (pd > 3) {
                print_fast_write_usage();
                return;
            }
            uint16_t code = atoi(embeddedCliGetToken(args, 2+(chan*2)));
            if (code > 4095) {
                print_fast_write_usage();
                return;
            }
            data[chan] = (pd << 12) | code;
        }
        uint8_t stopval = atoi(embeddedCliGetToken(args, 9));
        if (stopval > 1) {
            print_fast_write_usage();
            return;
        }
        stop = stopval == 1;
        if (!me->dac->fast_write(data, 4, stop, write_complete, me)) {
            printf("error writing to MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_read_usage()
{
    printf("usage:\r\n\tread nchan\r\n");
    printf("Read back alternate DAC output values and EEPROM values\r\n");
    printf("nchan is the number of channel data items to read. Each of DAC output register\r\n");
    printf("and the EEPROM register count as one chanel data item.\r\n");
    printf("For example, If nchan is 2, read both the DAC output register and the EEPROM\r\n");
    printf("register for DAC output A. If nchan is 4, then read each register for DAC A & B.\r\n");
    printf("If nchan is odd, then the last channel's EEPROM register will not be read\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::read_callback(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    auto rb = &me->readback_data;
    printf("MCP4728 # %u readback data:\r\n", me->current_dacnum);
    for (uint8_t chan = 0; chan < rb->nchan; chan++) {
        printf("channel %c %s registers:\r\n", 'A'+rb->data[chan].chan, rb->data[chan].is_eeprom ? "EEPROM":"DAC Output");
        printf("POR=%u RDY=%u \r\n", rb->data[chan].por, rb->data[chan].rdy);
        printf("code=%u G=%u PD=%u Vref=%u\r\n", rb->data[chan].dac_code, rb->data[chan].gain, rb->data[chan].pd, rb->data[chan].vref);
    }
}

void rppicomidi::RP2040_MCP4728_cli::status_callback(void* context, bool is_busy, bool is_powered_on)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    printf("MCP4728 # %u is %sbusy. MCP4728 # %u is %spowered on.\r\n", me->current_dacnum, is_busy?"":"not ", me->current_dacnum, is_powered_on?"":"not ");
}

void rppicomidi::RP2040_MCP4728_cli::on_read(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    // must be 1 argument (nchan, and 0<nchan<=8)
    if (argc != 1) {
        print_read_usage();
    }
    else {
        uint8_t nchan = atoi(embeddedCliGetToken(args, 1));
        if (nchan == 0 || nchan > 8) {
            print_read_usage();
            return;
        }
        me->readback_data.nchan = nchan;
        if (!me->dac->read_channels(me->readback_data.data,me->readback_data.nchan, read_callback, me)) {
            printf("error starting MCP4728 # %u read\r\n", me->current_dacnum);
        }
        else {
            printf("read MCP4728 # %u started\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_status(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("Print the Ready/Busy status and the powered-on status. usage: status");
    }
    else if (!me->dac->poll_status(status_callback, &me->readback_data)) {
        printf("error starting MCP4728 # %u read\r\n", me->current_dacnum);
    }
    else {
        printf("read MCP4728 # %u started\r\n", me->current_dacnum);
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_write_eeprom_usage()
{
    printf("usage:\r\n\tchannel[A-D]|nchan UDAC[0|1] G[0|1] Vref[0|1] PD[0-3] Code[0-4095]...\r\n");
    printf("channel can be A, B, C or D for single channel write, or specify a nchan=2, 3, or 4\r\n");
    printf("to write to channels C-D, B-D, or A-D, respectively.\r\n");
    printf("UDAC=0 means update each output after channel data write; UDAC=1 writes registers but does not update the outputs\r\n");
    printf("G=0 means gain=1; G=1 means gain=2 if Vref=1 and Vdd>4.096V\r\n");
    printf("Vref=0 means Vref=Vdd; Vref=1 means Vref=2.048V\r\n");
    printf("PD=0 means out on; PD=1 means out off and 1kOhm to gnd;\r\nPD=2 means out off and 100kOhm to gnd; PD=3 means out off and 500kOhm to gnd\r\n");
    printf("Code is the 12-bit DAC code 0-4095\r\n");
    printf("example: Set up channels C and D to update immediately with Gain=1, Vref=Vdd, Outputs On,\n\r");
    printf("output Vdd/2 and Vdd/ and then program EEPROM for channels C and D\r\n");
    printf("\twrite-eeprom 2 0 0 0 0 2048 0 0 0 1024\r\n");
    printf("example: Set up channel B, update by LDAC\\, for Gain=1, Vref=2.048V, Outputs On, \n\r");
    printf("output 100mV\r\n");
    printf("\twrite-eeprom B 1 0 1 0 200\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_write_eeprom(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc < 6 || ((argc-2) %4) != 0) {
        print_write_eeprom_usage();
    }
    else {
        const uint8_t nchan = (argc-2)/4;
        rppicomidi::mcp4728_channel_data chan_dat[nchan];

