rppicomidi/rp2040-mcp4728-lib/rp2040_mcp4728_cli.cpp
        // Get channel letter
        const char* ch = embeddedCliGetToken(args, 1);
        if (strlen(ch) != 1) {
            print_write_eeprom_usage();
            return;
        }
        if (ch[0] > '1' && ch[0] <= '4') {
            // then it is a number of channels.
            if (nchan != (ch[0] - '0')) {
                print_write_eeprom_usage();
                return;
            }
        }
        else if (nchan == 1) {
            char chan = toupper(ch[0]);
            if (chan >= 'A' && chan <= 'D') {
                chan_dat[0].chan = chan - 'A';
            }
            else {
                print_write_eeprom_usage();
                return;
            }
        }
        else {
            print_write_eeprom_usage();
            return;
        }

        chan_dat[0].udac = atoi(embeddedCliGetToken(args, 2));
        if (chan_dat[0].udac > 1) {
            print_write_eeprom_usage();
            return;
        }
        for (uint8_t chan = 0; chan < nchan; chan++) {
            chan_dat[chan].gain = atoi(embeddedCliGetToken(args, 3 + (chan*4)));
            if (chan_dat[chan].gain > 1) {
                print_write_eeprom_usage();
                return;
            }
            chan_dat[chan].vref = atoi(embeddedCliGetToken(args, 4 + (chan*4)));
            if (chan_dat[chan].vref > 1) {
                print_write_eeprom_usage();
                return;
            }
            chan_dat[chan].pd = atoi(embeddedCliGetToken(args, 5 + (chan*4)));
            if (chan_dat[chan].pd > 3) {
                print_write_eeprom_usage();
                return;
            }
            chan_dat[chan].dac_code = atoi(embeddedCliGetToken(args, 6 + (chan*4)));
            if (chan_dat[chan].dac_code > 4095) {
                print_write_eeprom_usage();
                return;
            }
        }
        if (!me->dac->sequential_write_eeprom(chan_dat, nchan, seq_write_complete, me)) {
            printf("error writing EEPROM on MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_set_gains_usage()
{
    printf("usage:\r\n\tset-gains gainA gainB gainC gainD\r\n");
    printf("gainx=0 means gain of 1; gainx=1 means gain of 2\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_set_gains(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 4) {
        print_set_gains_usage();
    }
    else {
        bool gains[4];
        for (uint8_t idx = 1; idx <= 4; idx++) {
            const char* tok = embeddedCliGetToken(args, idx);
            if (strlen(tok) != 1 || (tok[0] != '0' && tok[0] !='1')) {
                print_set_gains_usage();
                return;
            }
            gains[idx-1] = tok[0] == '1';
        }
        if (!me->dac->set_all_gains(gains[0], gains[1], gains[2], gains[3], write_complete, me)) {
            printf("error writing to MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_set_vrefs_usage()
{
    printf("usage:\r\n\tset-vrefs vrefA vrefB vrefC vrefD\r\n");
    printf("vrefx=0 means Vref is Vdd; vrefx=1 means Vref=2.048V\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_set_vrefs(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 4) {
        print_set_gains_usage();
    }
    else {
        bool vrefs[4];
        for (uint8_t idx = 1; idx <= 4; idx++) {
            const char* tok = embeddedCliGetToken(args, idx);
            if (strlen(tok) != 1 || (tok[0] != '0' && tok[0] !='1')) {
                print_set_gains_usage();
                return;
            }
            vrefs[idx-1] = tok[0] == '1';
        }
        if (!me->dac->set_all_vrefs(vrefs[0], vrefs[1], vrefs[2], vrefs[3], write_complete, nullptr)) {
            printf("error writing to MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::print_set_pds_usage()
{
    printf("usage:\r\n\tset-pds pdA pdB pdC pdD\r\n");
    printf("pdx=0 means channel x is on;\r\n");
    printf("pdx=1 means channel x is off with output shorted to ground via a 1kohm resistor\r\n");
    printf("pdx=2 means channel x is off with output shorted to ground via a 100kohm resistor\r\n");
    printf("pdx=3 means channel x is off with output shorted to ground via a 500kohm resistor\r\n");
}

void rppicomidi::RP2040_MCP4728_cli::on_set_pds(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 4) {
        print_set_gains_usage();
    }
    else {
        uint8_t pds[4];
        for (uint8_t idx = 1; idx <= 4; idx++) {
            const char* tok = embeddedCliGetToken(args, idx);
            if (strlen(tok) != 1 || (tok[0] != '0' && tok[0] !='1' && tok[0]!='2' && tok[0]!='3')) {
                print_set_gains_usage();
                return;
            }
            pds[idx-1] = tok[0] - '0';
        }
        if (!me->dac->set_all_pds(pds[0], pds[1], pds[2], pds[3], write_complete, me)) {
            printf("Error writing to MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_reset(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("usage: reset\r\n");
    }
    else {
        if (!me->dac->reset(reset_complete, me)) {
            printf("error sending reset\r\n");
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_wakeup(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("usage: wakeup\r\n");
    }
    else {
        if (!me->dac->wakeup(reset_complete, me)) {
            printf("error sending wakeup\r\n");
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_update(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("usage: update\r\n");
    }
    else {
        if (!me->dac->update_all_channels(reset_complete, me)) {
            printf("error sending update\r\n");
        }
    }
}

