rppicomidi/rp2040-mcp4728-lib/rp2040_mcp4728_cli.cpp
#if 0
void rppicomidi::RP2040_MCP4728_cli::on_set_ldac_gpio(EmbeddedCli *, char *args, void *)
{
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 1) {
        printf("usage: ldac-gpio [gpio-num]\r\n\twhere [gpio-num] is 0-31\r\n");
    }
    else {
        uint gpionum = atoi(embeddedCliGetToken(args, 1));
        if (gpionum > 31)
            printf("usage: ldac-gpio [gpio-num]\r\n\twhere [gpio-num] is 0-31\r\n");
        else {
            if (ldac_gpio != 0xff) {
                //gpio_deinit(ldac_gpio);
                gpio_put(ldac_gpio, true); // set it high
            }
            ldac_gpio = gpionum;
            gpio_set_dir(ldac_gpio, true);
            gpio_put(ldac_gpio, true);
            gpio_set_function(ldac_gpio, GPIO_FUNC_SIO);
        }
    }
}
#endif

void rppicomidi::RP2040_MCP4728_cli::print_on_select_dac_usage(RP2040_MCP4728_cli* context)
{
    printf("usage: select-dac 0-%u\r\n", context->ndacs-1);
}

void rppicomidi::RP2040_MCP4728_cli::assign_next_bus()
{
    current_dacnum = next_dacnum;
    dac = dac_list + next_dacnum;
    int result = dac->request_bus(allocation_successful, this);
    if (result == -1) {
        printf("bus allocation problem\r\n");
    }
    else if (result == 0) {
        printf("bus allocation deferred until other device releases the bus\r\n");
    }
    else {
        printf("MCP4728 # %u is currently accessible on the I2C bus at address 0x%02x\r\n", current_dacnum, dac->get_addr());
    }
}

void rppicomidi::RP2040_MCP4728_cli::release_bus_callback(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    printf("bus released\r\n");
    me->assign_next_bus();
}

void rppicomidi::RP2040_MCP4728_cli::on_select_dac(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    if (me->ndacs == 1) {
        printf("There is only one MCP4728 chip on this I2C bus. Nothing to select.\r\n");
        return;
    }
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 1) {
        print_on_select_dac_usage(me);
    }
    else {
        uint8_t dacnum = atoi(embeddedCliGetToken(args, 1));
        if (dacnum >= me->ndacs) {
            print_on_select_dac_usage(me);
        }
        else {
            if (me->dac == me->dac_list+dacnum) {
                printf("DAC chip %u already selected\r\n", dacnum);
            }
            else {
                me->next_dacnum = dacnum;
                int result = me->dac->release_bus(release_bus_callback, me);
                if (result == 1) {
                    me->assign_next_bus();
                }
                else if (result == 0) {
                    printf("bus release deferred\r\n");
                }
                else {
                    printf("MCP4728 # %u never had control of the I2C bus\r\n", me->current_dacnum);
                }
            }
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_set_ldac(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 1) {
        printf("usage: set-ldac 0|1\r\n");
    }
    else {
        int val = atoi(embeddedCliGetToken(args, 1));
        if (val > 1 || val < 0)
            printf("usage: set-ldac 0|1\r\n");
        else if (!me->dac->set_ldac_pin(val==1)) {
            printf("error: no LDAC pin is defined for MCP4728 # %u\r\n", me->current_dacnum);
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_read_i2c_addr(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("usage: read-addr\r\n");
    }
    else if (!me->dac->set_ldac_pin(true)) {
        printf("error: no LDAC pin is defined for MCP4728 # %u\r\n", me->current_dacnum);
    }
    else {
        uint8_t read_addr;
        if (!me->dac->access_addr_bits(0, read_addr)) {
            printf("problem reading address bits from DAC\r\n");
        }
        else {
            printf("MCP4728 # %u raw value read =0x%02x\r\n", me->current_dacnum, read_addr);
            printf("I2C address in EEPROM=%02x in input register=%02x\r\n",
                0x60|(((read_addr)>>5) & 0x7), 0x60|(((read_addr)>>1) & 0x7));
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_write_i2c_addr(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 1) {
        printf("usage: write-addr [0x60-0x67]\r\n");
    }
    else if (!me->dac->set_ldac_pin(true)) {
        printf("error: no LDAC pin is defined for MCP4728 # %u\r\n", me->current_dacnum);
    }
    else {
        uint8_t new_addr = strtol(embeddedCliGetToken(args, 1), nullptr, 16);
        if (new_addr >= 0x60 && new_addr <= 0x67) {
            uint8_t dummy;
            if (!me->dac->access_addr_bits(new_addr, dummy)) {
                printf("problem writing address bits to MCP4728 # %u\r\n", me->current_dacnum);
            }
            else {
                printf("new EEPROM address 0x%02x written to MCP4728 # %u\r\n", new_addr, me->current_dacnum);
            }
        }
        else {
            printf("usage: write-addr [0x60-0x67]\r\n");
        }
    }
}

void rppicomidi::RP2040_MCP4728_cli::save_cmd_read_callback(void* context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    rppicomidi::mcp4728_channel_data data[4];
    printf("Read of MCP4728 # %u complete. Starting EEPROM write\r\n", me->current_dacnum);
    for (uint8_t chan = 0; chan < 4; chan++) {
        data[chan].chan = me->readback_data.data[chan*2].chan;
        data[chan].dac_code = me->readback_data.data[chan*2].dac_code;
        data[chan].gain = me->readback_data.data[chan*2].gain;
        data[chan].pd = me->readback_data.data[chan*2].pd;
        data[chan].vref = me->readback_data.data[chan*2].vref;
        data[chan].udac = 1; // don't update the outputs as long as LDAC is high
    }

    if (!me->dac->sequential_write_eeprom(data, 4, write_complete, context)) {
        printf("error writing to MCP4728 # %u\r\n", me->current_dacnum);
    }
}

void rppicomidi::RP2040_MCP4728_cli::on_save(EmbeddedCli *, char *args, void *context)
{
    auto me = reinterpret_cast<RP2040_MCP4728_cli*>(context);
    uint16_t argc = embeddedCliGetTokenCount(args);
    if (argc != 0) {
        printf("usage: save\r\n");
    }
    else {
        if (!me->dac->read_channels(me->readback_data.data, me->readback_data.nchan, save_cmd_read_callback, me)) {
            printf("error starting MCP4728 # %u read\r\n", me->current_dacnum);
        }
        else {
            printf("reading MCP4728 # %u input registers\r\n", me->current_dacnum);
        }
    }
}
